<?php 
	$news = [
		[
			'title' => 'GitHub получил поддержку системы AWS CodeStar',
			'date' => '16 октября 2017 в 14:31',
			'content' => 'Обзор кода, управление проектами, их развёртывание и мониторинг — для всего этого у GitHub есть сотни инструментов и сервисов. В их список добавилась ещё одна возможность 	— интеграция с AWS CodeStar.

					AWS CodeStar позволяет быстро разрабатывать, собирать и развёртывать приложения на AWS. Сервис предоставляет унифицированный пользовательский интерфейс, позволяющий управлять всеми процессами разработки программного обеспечения из единого центра.

					GitHub позволяет использовать цепочки непрерывной интеграции и непрерывного развёртывания с AWS CodeStar (continuous integration/continuous deployment, CI/CD). Это поможет управлять коммитами нового кода, его сборкой и развёртыванием AWS-приложений из одного места.

					Каждый шаблон проекта AWS CodeStar предоставляет возможность использования GitHub в качестве системы управления версиями для проектов, которые вы создаёте при помощи AWS.',
			'source' => 'блог GitHub Вячеслав Шарунов'
		],

		[
			'title' => 'Крупные компании поддержали экосистему для разработки ИИ от Microsoft и Facebook ',
			'date' => '12 октября 2017 в 13:27',
			'content' => 'Компании Facebook и Microsoft объединили усилия для преодоления необходимости использовать несколько фреймворков для разработки одного приложения на базе ИИ. Их решение — проект ONNX (Open Neural Network Exchange), позволяющий разработчикам переключаться между фреймворками PyTorch и Caffe2 в любой момент разработки.

				И, по всей видимости, компании не имели ни малейшего сомнения, что их проект привлечёт других крупных участников рынка ИИ. В проекте ONNX уже участвуют IBM, Huawei, Intel, AMD, ARM и Qualcomm. Вот как представители Facebook комментируют подобное сотрудничество:

				В группах FAIR и AML мы постоянно стараемся разработать лучшие алгоритмы. Когда мы этого добиваемся, мы как можно быстрее делаем их доступными обществу. Участники ONNX сосредоточены на том, чтобы сблизить наши области исследований для скорейшего внедрения инноваций в рабочие продукты.
				Это означает, что участие компаний в ONNX ускоряет процесс разработки технологий ИИ, делая такие проекты, как беспилотные автомобили, реальностью. Стоит отметить, что Microsoft объявила о скорой поддержке других инструментов разработки, в том числе Cognitive Toolkit и Project Brainwave.

				Однако это далеко не первая коллаборация больших компаний, объединяющихся для развития ИИ. Так, Microsoft и Facebook уже являются участниками группы Partnership on AI, куда также входят Apple, Amazon, Google и IBM. Эта команда занимается повышением осведомлённости общественности в области ИИ и стимулированием исследований в этой сфере. Забавно, как машинное обучение может превратить соперников в приятелей. Может быть, в конце концов ИИ и не уничтожит человечество.',
			'source' => 'Engadget Вячеслав Шарунов'
		]


	];

?>